OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
// The effective admin username.  Auth is keyed on the *password* being set;
// when a password exists but the username was left blank, we fall back to a
// non-obvious default rather than treating the device as open (F1).
static String effectiveAdminUser()
{
  return www_username.length() > 0 ? www_username : String("openevseadmin");
}

// -------------------------------------------------------------------
// Session-cookie auth helper (browser UI)
//
// Extracts the oevse_session cookie from the request, verifies its HMAC
// signature and expiry against the current secret, and returns true when
// the cookie is valid.  File-local; consumed by isAuthenticated() below
// and the login handler (Task 7).
// -------------------------------------------------------------------
static bool hasValidSessionCookie(MongooseHttpServerRequest *request)
{
  // Cookies are inert until the wall clock is set: an unexpirable cookie is
  // worse than none, and this closes the replay-after-reboot window (a
  // captured cookie can't verify while time() is ~0).  Basic auth still works.
  if(!clockIsSane()) {
    return false;
  }
  String secret = web_auth_get_secret();
  if(secret.length() == 0) {
    return false;  // no secret yet — fail closed
  }
  MongooseString cookieHdr = request->headers("Cookie");
  if(!cookieHdr) {
    return false;
  }
  std::string tok = cookie_extract(
    std::string(cookieHdr.c_str(), cookieHdr.length()), "oevse_session");
  if(tok.empty()) {
    return false;
  }
  return session_token_verify(
    std::string(secret.c_str()), tok, (uint32_t)time(nullptr));
}

// Decode a `Basic <base64>` Authorization header into user and password.
//
// Mongoose 7 dropped mg_parse_http_basic_auth(). Its replacement,
// mg_http_creds(), needs the whole mg_http_message and additionally accepts
// Bearer tokens and an ?access_token= query parameter — credentials in a URL
// land in logs and Referer headers, and this gate has never honoured either
// form, so decode the one header we do accept rather than widening the surface.
//
// Returns true only on a well-formed header that fit the caller's buffers.
static bool parseBasicAuth(const mg_str &hdr, char *user, size_t userLen,
                           char *pass, size_t passLen)
{
  const char *scheme = "Basic ";
  const size_t schemeLen = 6;

  if(hdr.len <= schemeLen ||
     0 != mg_strcasecmp(mg_str_n(hdr.buf, schemeLen), mg_str(scheme))) {
    return false;
  }

  // Sized for the 64-byte user and password buffers above, plus the separator.
  char decoded[136];
  size_t decodedLen = mg_base64_decode(hdr.buf + schemeLen, hdr.len - schemeLen,
                                       decoded, sizeof(decoded));
  if(0 == decodedLen) {
    return false;
  }

  // "user:password" — a password may contain ':', a username may not, so split
  // on the first one.
  const char *sep = (const char *)memchr(decoded, ':', decodedLen);
  if(nullptr == sep) {
    return false;
  }

  size_t uLen = sep - decoded;
  size_t pLen = decodedLen - uLen - 1;
  if(uLen >= userLen || pLen >= passLen) {
    return false;
  }

  memcpy(user, decoded, uLen);
  user[uLen] = '\0';
  memcpy(pass, sep + 1, pLen);
  pass[pLen] = '\0';

  return true;
}

// -------------------------------------------------------------------
// Single source of truth for HTTP authentication
//
// Used by both the REST path (requestPreProcess) and the WebSocket connect
// gate (wsAuthorise). Returns true when the request is permitted:
//  - AP-only provisioning mode (captive portal, before credentials are set), or
//  - no password configured (auth disabled), or
//  - a valid Basic Authorization header (machine clients: HA, MQTT, app), or
//  - a valid session cookie (browser UI).
// Parsing reuses the library's tested Basic-auth parser; only the comparison is
// swapped for a constant-time one. `badCredential` (optional) is set when a
// Basic header carried the wrong password, so requestPreProcess can escalate
// to a throttle response without re-parsing.
// -------------------------------------------------------------------
bool isAuthenticated(MongooseHttpServerRequest *request, bool *usedCookie, bool *badCredential)
{
  if(usedCookie) *usedCookie = false;
  if(badCredential) *badCredential = false;

  // Auth is keyed on the *password*: a blank password means "no auth" even if a
  // username is set; a set password with a blank username uses a default user
  // (effectiveAdminUser) rather than leaving the device open (F1).
  if(net.isWifiModeApOnly() || www_password == "") {
    return true;
  }

  String adminUser = effectiveAdminUser();

  // Basic auth (machine clients: HA, MQTT, app, scripts)
  MongooseString authHeader = request->headers("Authorization");
  if(authHeader) {
    mg_str hdr = authHeader.toMgStr();
    char user_buf[64] = {0};
    char pass_buf[64] = {0};
    if(parseBasicAuth(hdr, user_buf, sizeof(user_buf),
                      pass_buf, sizeof(pass_buf))) {
      bool u = credentialsMatch(adminUser.c_str(), user_buf);
      bool p = credentialsMatch(www_password.c_str(), pass_buf);
      if(u && p) {
        // Correct credentials always win and clear the throttle, so a flood of
        // bad guesses can never lock out a machine client holding the password.
        auth_throttle_record_success(s_authThrottle, authNowSecs());
        return true;
      }
      // Wrong Basic credential — feed the same throttle as POST /login so a
      // brute force can't dodge the counter by hammering GET /status.
      auth_throttle_record_failure(s_authThrottle, authNowSecs());
      if(badCredential) *badCredential = true;
    }
  }

  // Session cookie (browser UI) — computed exactly once here
  bool cookie = hasValidSessionCookie(request);
  if(usedCookie) *usedCookie = cookie;
  return cookie;
}

// -------------------------------------------------------------------
// POST /login  — credential check + session cookie mint
// POST /logout — session cookie clear
//
// Both handlers build their own response and intentionally do NOT call
// requestPreProcess / isAuthenticated: an unauthenticated user must be
// able to reach /login, and /logout should always succeed.
// -------------------------------------------------------------------
static const uint32_t REMEMBER_TTL = 2592000; // 30 days
static const uint32_t SESSION_TTL  = 21600;   // 6 hours

