OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  return true;
}

// -------------------------------------------------------------------
// Helper function to detect positive string
// -------------------------------------------------------------------
bool isPositive(const String &str) {
  return str == "1" || str == "true";
}

bool isPositive(MongooseHttpServerRequest *request, const char *param) {
  char paramValue[8];
  int paramFound = request->getParam(param, paramValue, sizeof(paramValue));
  return paramFound >= 0 && (0 == paramFound || isPositive(String(paramValue)));
}

// -------------------------------------------------------------------
// Escape a string for safe inclusion in an HTML response body, so that
// reflected user input cannot be interpreted as markup or script.
// -------------------------------------------------------------------
static String html_escape(const String &input) {
  String out;
  out.reserve(input.length());
  for(size_t i = 0; i < input.length(); i++) {
    char c = input.charAt(i);
    switch(c) {
      case '&':  out += F("&amp;");  break;
      case '<':  out += F("&lt;");   break;
      case '>':  out += F("&gt;");   break;
      case '"':  out += F("&quot;"); break;
      case '\'': out += F("&#39;");  break;
      default:   out += c;           break;
    }
  }
  return out;
}

//---------------------------------------------------------------------
// Build status data
// --------------------------------------------------------------------

// Capacity for any document buildStatus() fills. Defined once because the two
// call sites had drifted: onWsConnect sized its document for 40 members while
// buildStatus emits around 95, so every websocket connect pushed a silently
// truncated status. ArduinoJson does not signal that with an error -- it just
// stops adding members. 131 = 128 plus the "notifications" object and its two
// members (count, severity).
#define STATUS_JSON_CAPACITY (JSON_OBJECT_SIZE(131) + 2048)

// LittleFS.totalBytes() and LittleFS.usedBytes() each run lfs_fs_size(), a
// full traversal of every metadata pair and data block in the filesystem,
// reading flash with the FS lock held. Arduino's wrapper discards whichever
// half of esp_littlefs_info() you did not ask for, so reporting both numbers
// cost three traversals per request.
//
// That made /status the most expensive poll on the device, and expensive in
// proportion to how full the filesystem is: measured on hardware, a trivial
// JSON endpoint answers in 11ms while /status took 94ms on a box with 57KB
// used and 143ms on one with 237KB used. The TSDB store grows, so the cost
// grows with it. With evcc and the Home Assistant integration polling, the
// main loop was stalled on flash reads several percent of the time -- and
// nothing drains the network stack while it is.
//
// These two numbers only move when something writes, so sample them on a
// timer rather than per request.
#define LFS_STATUS_SAMPLE_MS 30000

static void status_littlefs_usage(uint32_t &free_bytes, uint32_t &used_bytes)
{
  static uint32_t sampled_at = 0;
  static uint32_t cached_free = 0;
  static uint32_t cached_used = 0;

  uint32_t now = millis();
  if(0 == sampled_at || (now - sampled_at) >= LFS_STATUS_SAMPLE_MS)
  {
    size_t total = LittleFS.totalBytes();
    cached_used = (uint32_t)LittleFS.usedBytes();
    cached_free = (uint32_t)(total - cached_used);
    sampled_at = now;
  }

  free_bytes = cached_free;
  used_bytes = cached_used;
}

void buildStatus(DynamicJsonDocument &doc) {

  // Get the current time
  struct timeval local_time;
  gettimeofday(&local_time, NULL);

  struct tm * timeinfo = gmtime(&local_time.tv_sec);

  char time[64];
  char offset[8];
  strftime(time, sizeof(time), "%FT%TZ", timeinfo);
  strftime(offset, sizeof(offset), "%z", timeinfo);

  if (net.isWiredConnected()) {
    doc["mode"] = "Wired";
  } else if (net.isWifiModeStaOnly()) {
    doc["mode"] = "STA";
  } else if (net.isWifiModeApOnly()) {
    doc["mode"] = "AP";
  } else if (net.isWifiModeAp() && net.isWifiModeSta()) {
    doc["mode"] = "STA+AP";
  }

  doc["wifi_client_connected"] = (int)net.isWifiClientConnected();
  doc["eth_connected"] = (int)net.isWiredConnected();
  doc["net_connected"] = (int)net.isWifiClientConnected();
  doc["ipaddress"] = net.getIp();
  doc["ipv6address"] = net.getIpv6();
  doc["macaddress"] = net.getMac();

  doc["emoncms_connected"] = (int)emoncms_connected;
  doc["packets_sent"] = packets_sent;
  doc["packets_success"] = packets_success;

  doc["mqtt_connected"] = (int)mqtt.isConnected();
  doc["mqtt_status"]    = mqtt.getMqttStatus();
  if (mqtt.getBrokerIp()[0] != '\0')
    doc["mqtt_broker_ip"]      = mqtt.getBrokerIp();
  if (mqtt.getBrokerVersion()[0] != '\0')
    doc["mqtt_broker_version"] = mqtt.getBrokerVersion();
  if (mqtt.getConnectedSince() > 0)
    doc["mqtt_connected_since"] = (uint32_t)mqtt.getConnectedSince();
  if (mqtt.getLastRxTime() > 0)
    doc["mqtt_last_rx"]         = (uint32_t)mqtt.getLastRxTime();
  if (mqtt.getErrorCategory()[0] != '\0') {
    doc["mqtt_error"]        = mqtt.getErrorCategory();
    doc["mqtt_error_detail"] = mqtt.getErrorDetail();
  }

  doc["ocpp_connected"] = (int)OcppTask::isConnected();

#if defined(ENABLE_PN532) || defined(ENABLE_RFID)
  doc["rfid_failure"] = (int) rfid.communicationFails();
  doc["rfid_reader"] = (int) rfid.readerPresent();
#endif


  doc["free_heap"] = ESPAL.getFreeHeap();
  diagnostics_status(doc);
  {
    uint32_t lfs_free, lfs_used;
    status_littlefs_usage(lfs_free, lfs_used);
    doc["littlefs_free"] = lfs_free;
    doc["littlefs_used"] = lfs_used;
  }

  doc["comm_sent"] = rapiSender.getSent();
  doc["comm_success"] = rapiSender.getSuccess();
  doc["rapi_connected"] = (int)rapiSender.isConnected();
  doc["evse_connected"] = (int)evse.isConnected();

  create_rapi_json(doc);

  doc["gfcicount"] = evse.getFaultCountGFCI();
  doc["nogndcount"] = evse.getFaultCountNoGround();
  doc["stuckcount"] = evse.getFaultCountStuckRelay();

  doc["solar"] = divert.getSolar();
  doc["grid_ie"] = divert.getGridIe();
  doc["charge_rate"] = divert.getChargeRate();
  doc["divert_update"] = (millis() - divert.getLastUpdate()) / 1000;
  doc["divert_active"] = divert.isActive();
  doc["shaper"] = shaper.getState()?1:0;
  doc["shaper_live_pwr"] = shaper.getLivePwr();
  // doc["shaper_cur"] = shaper.getChgCur();
  doc["shaper_cur"] = shaper.getMaxCur();
  doc["shaper_updated"] = shaper.isUpdated();
  doc["service_level"] = static_cast<uint8_t>(evse.getActualServiceLevel());
  doc["limit"] = limit.hasLimit();
  doc["boost"] = boost.isActive();

  doc["ota_update"] = (int)Update.isRunning();

  doc["config_version"] = config_version();
  doc["loadsharing_peers_version"] = loadsharing_peers_version;
  doc["loadsharing_status_version"] = loadsharing_status_version;

  // Add joined peers array with real-time status from peer poller
  {
    JsonArray peersArray = doc.createNestedArray("loadsharing_joined_peers");
    double groupTotalAmp = 0.0;
    
    for (const auto& peer : loadSharingGroupState.getPeers()) {
      // Only include joined peers (exclude discovered-but-not-joined)
      if (!peer.isJoined()) {
        continue;
      }
      
