OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
      JsonObject peerObj = peersArray.createNestedObject();
      peerObj["hostname"] = peer.getHost();
      peerObj["id"] = peer.getId();
      peerObj["name"] = peer.getName();

      if (loadSharingGroupState.isLocalHost(peer.getHost())) {
        // The local device is not polled over HTTP/WebSocket; report its
        // values directly from the local EVSE (same sources as create_rapi_json
        // so they match what remote peers publish on /status).
        double localAmp = evse.getAmps() * AMPS_SCALE_FACTOR;
        peerObj["amp"] = localAmp;
        peerObj["voltage"] = evse.getVoltage() * VOLTS_SCALE_FACTOR;
        peerObj["pilot"] = evse.getChargeCurrent();
        peerObj["vehicle"] = evse.isVehicleConnected() ? 1 : 0;
        peerObj["state"] = evse.getEvseState();
        peerObj["min_current"] = evse.getMinCurrent();
        peerObj["max_current"] = evse.getMaxConfiguredCurrent();
        peerObj["priority"] = peer.getPriority();
        groupTotalAmp += localAmp;
        continue;
      }

      // Get real-time status from peer poller. min/max/priority are controller-
      // owned (min/max learned from the peer's /config, priority stored on the
      // group peer entry), not part of the polled status.
      LoadSharingPeerStatus peerStatus;
      if (loadSharingPeerPoller.getPeerStatus(peer.getHost(), peerStatus)) {
        peerObj["amp"] = peerStatus.getAmp();
        peerObj["voltage"] = peerStatus.getVoltage();
        peerObj["pilot"] = peerStatus.getPilot();
        peerObj["vehicle"] = peerStatus.getVehicle();
        peerObj["state"] = peerStatus.getState();
        peerObj["min_current"] = peer.getMinCurrent();
        peerObj["max_current"] = peer.getMaxCurrent();
        peerObj["priority"] = peer.getPriority();
        groupTotalAmp += peerStatus.getAmp();
      }
    }

    // The local device is included in the loop above (as a joined peer), so its
    // current is already part of groupTotalAmp -- no separate self addition.
    doc["loadsharing_group_current_total"] = groupTotalAmp;
  }

  doc["claims_version"] = evse.getClaimsVersion();
  doc["override_version"] = manual.getVersion();
  doc["schedule_version"] = scheduler.getVersion();
  doc["schedule_plan_version"] = scheduler.getPlanVersion();
  doc["limit_version"] = limit.getVersion();
  doc["boost_version"] = boost.getVersion();

  doc["vehicle_state_update"] = (millis() - evse.getVehicleLastUpdated()) / 1000;
  if(teslaClient.getVehicleCnt() > 0) {
    doc["tesla_vehicle_count"] = teslaClient.getVehicleCnt();
    doc["tesla_vehicle_id"] = teslaClient.getVehicleId(teslaClient.getCurVehicleIdx());
    doc["tesla_vehicle_name"] = teslaClient.getVehicleDisplayName(teslaClient.getCurVehicleIdx());
    teslaClient.getChargeInfoJson(doc);
  } else {
    doc["tesla_vehicle_count"] = false;
    doc["tesla_vehicle_id"] = false;
    doc["tesla_vehicle_name"] = false;
    if(evse.isVehicleStateOfChargeValid()) {
      doc["battery_level"] = evse.getVehicleStateOfCharge();
    }
    if(evse.isVehicleRangeValid()) {
      doc["battery_range"] = evse.getVehicleRange();
    }
    if(evse.isVehicleEtaValid()) {
      doc["time_to_full_charge"] = evse.getVehicleEta();
    }
    if(evse.isVehicleChargeLimitValid()) {
      doc["vehicle_charge_limit"] = evse.getVehicleChargeLimit();
    }
  }

#ifdef ENABLE_TSDB
  doc["tsdb_ready"] = tsdbEnergyLogger.isReady() ? 1 : 0;
  doc["tsdb_err"]   = tsdbEnergyLogger.initError();
#endif
  home_battery_add_status_fields(doc);

  // Exactly two fields: both UIs need a badge without a second round trip,
  // and nothing more belongs in a payload the HA integration already polls
  // hard. The list lives on /notifications. severity is a name ("info" /
  // "warning" / "critical"), matching how /notifications serialises it.
  JsonObject notify = doc.createNestedObject("notifications");
  notify["count"] = notifications.count();
  notify["severity"] = notification_severity_name(notifications.maxSeverity());

  DBUGF("/status ArduinoJson size: %dbytes", doc.size());
}

// -------------------------------------------------------------------
// Wifi scan
// url: /scan
// -------------------------------------------------------------------
void
handleScan(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }

  DBUGF("Starting WiFi scan");
  bool scanStarted = net.wifiScanNetworks([request, response](int networksFound) {
    DBUGF("%d networks found", networksFound);
    response->print("[");
    for (int i = 0; i < networksFound; ++i) {
      if(i) response->print(",");
      StaticJsonDocument<256> network;
      network["rssi"] = WiFi.RSSI(i);
      network["ssid"] = WiFi.SSID(i);
      network["bssid"] = WiFi.BSSIDstr(i);
      network["channel"] = WiFi.channel(i);
      network["secure"] = WiFi.encryptionType(i);
      serializeJson(network, *response);
    }
    response->print("]");
    request->send(response);
  });

  if(!scanStarted) {
    DBUGLN("WiFi scan failed to start");
    response->print("[]");
    request->send(response);
  }
}

// -------------------------------------------------------------------
// Destructive actuators (/reset, /restart, /apoff, /divertmode, /shaper,
// /settime, /rfid/add) must not fire from a bare cross-site GET (e.g.
// <img src="/reset">). Require either a non-GET method or
// the SPA's custom header, which a cross-origin GET cannot set — defense in
// depth beyond SameSite=Strict on the worst-consequence endpoints. Sends 403
// and returns false when the request is a headerless GET; the caller's response
// stream is already open (from requestPreProcess).
// -------------------------------------------------------------------
bool actuatorMethodAllowed(MongooseHttpServerRequest *request,
                           MongooseHttpServerResponseStream *response)
{
  if(request->method() != HTTP_GET) {
    return true;
  }
  MongooseString xrw = request->headers("X-Requested-With");
  if(xrw.equals("OpenEVSE")) {
    return true;
  }
  response->setCode(403);
  response->print("Forbidden: use POST or the app");
  request->send(response);
  return false;
}

// -------------------------------------------------------------------
// Handle turning Access point off
// url: /apoff
// -------------------------------------------------------------------
void
handleAPOff(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  response->setCode(200);
  response->print("Turning AP Off");
  request->send(response);

  DBUGLN("Turning AP Off");
  apOffTime = millis() + 1000;
}

// -------------------------------------------------------------------
// Change divert mode (solar PV divert mode) e.g 1:Normal (default), 2:Eco
// url: /divertmode
// -------------------------------------------------------------------
void
handleDivertMode(MongooseHttpServerRequest *request){
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  DivertMode divertmode = (DivertMode)(request->getParam("divertmode").toInt());
  divert.setMode(divertmode);

  response->setCode(200);
  response->print("Divert Mode changed");
  request->send(response);

