OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  DBUGF("Divert Mode: %d", divertmode);
}

// -------------------------------------------------------------------
// Change current shaper mode 0:disable (default), 1:Enable
// url: /shaper
// -------------------------------------------------------------------
void
handleCurrentShaper(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  shaper.setState(request->getParam("shaper").toInt() == 1? true: false);

  response->setCode(200);
  response->print("Current Shaper state changed");
  request->send(response);

  DBUGF("CurrentShaper: %d", shaper.getState());
}

// -------------------------------------------------------------------
// Manually set the time
// url: /settime
// -------------------------------------------------------------------
void handleSetTime(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  handleTimePost(request, response);

  request->send(response);
}

// -------------------------------------------------------------------
// Get Tesla Vehicle Info
// url: /teslaveh
// -------------------------------------------------------------------
void
handleTeslaVeh(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  StaticJsonDocument<1024> doc;
  int count = teslaClient.getVehicleCnt();
  doc["count"] = count;
  JsonArray vehicles = doc.createNestedArray("vehicles");

  for (int i = 0; i < count; i++)
  {
    JsonObject vehicle = vehicles.createNestedObject();
    vehicle["id"] = teslaClient.getVehicleId(i);
    vehicle["name"] = teslaClient.getVehicleDisplayName(i);
  }

  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}

// -------------------------------------------------------------------
// Whether vehicle telemetry pushed to POST /status should be accepted.
//
// The four vehicle fields below each repeated the same source comparison, which
// is one copy-paste away from a field that quietly accepts a push it should
// not, or rejects one it should. Naming the rule once means the next field
// added here inherits it rather than restating it.
//
// Sources that own the vehicle data themselves are excluded on purpose: a push
// must not be able to fight a source that is actively fetching the same values.
// -------------------------------------------------------------------
static bool vehiclePushAccepted()
{
  return VEHICLE_DATA_SRC_HTTP == vehicle_data_src;
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void handleStatusPost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();
  // Deserialize the JSON document
  const size_t capacity = JSON_OBJECT_SIZE(32) + 1024;
  DynamicJsonDocument doc(capacity);
  DeserializationError error = deserializeJson(doc, body);
  if(!error)
  {
    bool send_event = true;

    if(doc.containsKey("voltage"))
    {
      double volts = doc["voltage"];
      DBUGF("voltage:%.1f", volts);
      evse.setVoltage(volts);
    }
    if(doc.containsKey("shaper_live_pwr"))
    {
      double shaper_live_pwr = doc["shaper_live_pwr"];
      shaper.setLivePwr(shaper_live_pwr);
      DBUGF("shaper: live power:%dW", shaper.getLivePwr());
    }
    if(doc.containsKey("solar")) {
      int solar = doc["solar"];
      divert.setSolar(solar);
      DBUGF("solar:%dW", solar);
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    else if(doc.containsKey("grid_ie")) {
      int grid_ie = doc["grid_ie"];
      divert.setGridIe(grid_ie);
      DBUGF("grid:%dW", grid_ie);
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    if(doc.containsKey("battery_level") && vehiclePushAccepted()) {
      double vehicle_soc = doc["battery_level"];
      DBUGF("vehicle_soc:%d%%", vehicle_soc);
      evse.setVehicleStateOfCharge(vehicle_soc);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("battery_range") && vehiclePushAccepted()) {
      double vehicle_range = doc["battery_range"];
      DBUGF("vehicle_range:%dKM", vehicle_range);
      evse.setVehicleRange(vehicle_range);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("time_to_full_charge") && vehiclePushAccepted()){
      double vehicle_eta = doc["time_to_full_charge"];
      DBUGF("vehicle_eta:%d", vehicle_eta);
      evse.setVehicleEta(vehicle_eta);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("vehicle_charge_limit") && vehiclePushAccepted()){
      int vehicle_charge_limit = doc["vehicle_charge_limit"];
      DBUGF("vehicle_charge_limit:%d%%", vehicle_charge_limit);
      evse.setVehicleChargeLimit(vehicle_charge_limit);
      doc["vehicle_state_update"] = 0;
    }
    // Display-only home/powerwall battery feeds. Like the solar/grid pushes
    // above these are an explicit override (no data_src arbitration); they just
    // surface in /status and on the display.
    if(doc.containsKey("home_battery_soc")) {
      int soc = doc["home_battery_soc"];
      DBUGF("home_battery_soc:%d%%", soc);
      home_battery_set_soc(soc);
    }
    if(doc.containsKey("home_battery_power")) {
      int power = doc["home_battery_power"];
      DBUGF("home_battery_power:%dW", power);
      home_battery_set_power(power);
    }
    // send back new value to clients
    if(send_event) {
      event_send(doc);
    }
    response->setCode(200);
    serializeJson(doc, *response);
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
  }
}


void
handleStatus(MongooseHttpServerRequest *request)
{

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

