OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  if(HTTP_GET == request->method()) {

    // Allocated once and reused. Building a fresh multi-KB document per
    // request, freed again immediately, is what fragments this heap: measured
    // on hardware, sustained polling of /status alone drove the largest
    // allocatable block from 61,428 down to 38,900 and it never recovered,
    // while total free heap stayed above 70KB.
    //
    // Safe as a static because Mongoose is polled from loop() on a single
    // task and each handler runs to completion inside its own event callback;
    // this one calls nothing that re-enters the HTTP layer.
    static DynamicJsonDocument doc(STATUS_JSON_CAPACITY);
    doc.clear();

    uint32_t probe = diagnostics_probe_begin();
    buildStatus(doc);
    diagnostics_probe_end(0, probe);

    response->setCode(200);
    probe = diagnostics_probe_begin();
    // Serialise into a right-sized buffer and hand the stream one write.
    // Writing incrementally makes the stream's mbuf realloc up a 1.5x ladder
    // (128->192->288->...->2187 for a 1.7KB body): eight ascending
    // allocate/free pairs per request, which is what shreds the heap. One
    // reserved String plus one write is two exact-sized allocations.
    String json;
    json.reserve(measureJson(doc) + 1);
    serializeJson(doc, json);
    response->write((const uint8_t *)json.c_str(), json.length());
    diagnostics_probe_end(1, probe);

  } else if(HTTP_POST == request->method()) {
    handleStatusPost(request, response);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

// -------------------------------------------------------------------
//
// url: /schedule
// -------------------------------------------------------------------
void
handleScheduleGet(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  // Sized from the stored event count — a fixed budget silently truncated
  // multi-rule schedules (serialize() drops events once the doc overflows).
  DynamicJsonDocument doc(scheduler.scheduleJsonCapacity());

  bool success = (SCHEDULER_EVENT_NULL == event) ?
    scheduler.serialize(doc) :
    scheduler.serialize(doc, event);

  if(success) {
    response->setCode(200);
    serializeJson(doc, *response);
  } else {
    response->setCode(404);
    response->print("{\"msg\":\"Not found\"}");
  }
}

void
handleSchedulePost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  String body = request->body().toString();

  bool success = (SCHEDULER_EVENT_NULL == event) ?
    scheduler.deserialize(body) :
    scheduler.deserialize(body, event);

  if(success) {
    response->setCode(200);
    response->print("{\"msg\":\"done\"}");
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
  }
}

void
handleScheduleDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  if(SCHEDULER_EVENT_NULL != event)
  {
    if(scheduler.removeEvent(event)) {
      response->setCode(200);
      response->print("{\"msg\":\"done\"}");
    } else {
      response->setCode(404);
      response->print("{\"msg\":\"Not found\"}");
    }
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }
}

#define SCHEDULE_PATH_LEN (sizeof("/schedule/") - 1)

void
handleSchedule(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  uint16_t event = SCHEDULER_EVENT_NULL;

  String path = request->uri();
  if(path.length() > SCHEDULE_PATH_LEN) {
    String eventStr = path.substring(SCHEDULE_PATH_LEN);
    DBUGVAR(eventStr);
    event = eventStr.toInt();
  }

  DBUGVAR(event);

  if(HTTP_GET == request->method()) {
    handleScheduleGet(request, response, event);
  } else if(HTTP_POST == request->method()) {
    handleSchedulePost(request, response, event);
  } else if(HTTP_DELETE == request->method()) {
    handleScheduleDelete(request, response, event);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

void
handleSchedulePlan(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  const size_t capacity = JSON_OBJECT_SIZE(40) + 2048;
  DynamicJsonDocument doc(capacity);

  scheduler.serializePlan(doc);
  response->setCode(200);
  serializeJson(doc, *response);

  request->send(response);
}

//----------------------------------------------------------
//
//            Limit
//
//----------------------------------------------------------

void handleLimitGet(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(limit.hasLimit())
  {
    limit.get().serialize(response);
  } else {
    response->setCode(200);
    response->print("{}");
  }
}

void handleLimitPost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();

    if (limit.set(body)) {
      response->setCode(201);
      response->print("{\"msg\":\"done\"}");
    } else {
      // unused for now
      response->setCode(400);
      response->print("{\"msg\":\"failed to parse JSON\"}");
    }
}

void handleLimitDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(limit.hasLimit()) {
    if (limit.clear()) {
      response->setCode(200);
      response->print("{\"msg\":\"done\"}");
    } else {
      response->setCode(500);
      response->print("{\"msg\":\"failed\"}");
    }
  } else {
    response->setCode(200);
    response->print("{\"msg\":\"no limit\"}");
  }
}

void handleLimit(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

