OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  if (HTTP_GET == request->method()) {
    response->setCode(200);
    response->print("1");
    request->send(response);
    restart_system();
  }
  else if (HTTP_POST == request->method()) {
    String body = request->body().toString();
    // Deserialize the JSON document
    const size_t capacity = JSON_OBJECT_SIZE(1) + 16;
    DynamicJsonDocument doc(capacity);
    DeserializationError error = deserializeJson(doc, body);
    if(!error)
    {
      if(doc.containsKey("device")){
        if (strcmp(doc["device"], "gateway") == 0 ) {
          response->setCode(200);
          response->print("{\"msg\":\"restart gateway\"}");
          request->send(response);
          restart_system();
        }
        else if (strcmp(doc["device"], "evse") == 0) {
          response->setCode(200);
          response->print("{\"msg\":\"restart evse\"}");
          request->send(response);
          evse.restartEvse();
        }
        else {
          response->setCode(404);
          response->print("{\"msg\":\"unknown device\"}");
          request->send(response);
        }
      }
      else {
        response->setCode(400);
        response->print("{\"msg\":\"wrong payload\"}");
        request->send(response);
      }
    } else {
      response->setCode(400);
      response->print("{\"msg\":\"Couldn't parse json\"}");
      request->send(response);
    }
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
    request->send(response);
  }
}

// -------------------------------------------------------------------
// Emoncms describe end point,
// Allows local device discover using https://github.com/emoncms/find
// url: //emoncms/describe
// -------------------------------------------------------------------
void handleDescribe(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseBasic *response = request->beginResponse();
  response->setCode(200);
  response->setContentType(CONTENT_TYPE_TEXT);
  response->addHeader("Access-Control-Allow-Origin", "*");
  response->setContent("openevse");
  request->send(response);
}

void handleAddRFID(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  response->setCode(200);
  response->addHeader("Access-Control-Allow-Origin", "*");
  response->print("{\"msg\":\"Waiting for badge\"}");
  request->send(response);
  yield();
  rfid.waitForTag();
}

// -------------------------------------------------------------------
// Reset the relay contact-life health estimate ($FH via EvseManager,
// requires the controller's RELAY_HEALTH feature) - use after a physical
// relay replacement, so the accumulator doesn't carry over wear from the
// old relay.
// url: /relay/reset
// -------------------------------------------------------------------
void handleRelayHealthReset(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  evse.resetRelayHealth([request, response](int ret) {
    response->setCode(RAPI_RESPONSE_OK == ret ? 200 : 500);
    response->print(RAPI_RESPONSE_OK == ret ? "{\"msg\":\"done\"}" : "{\"msg\":\"error\"}");
    request->send(response);
  });
}

// -------------------------------------------------------------------
// Manually run the stuck-relay recovery cycle ($FK via EvseManager,
// requires firmware 9.3.0+ / ADVPWR). NAK'd by the controller if an EV is
// connected. Blocking on the controller side for up to ~30s - the HTTP
// response is deferred until the async RAPI callback fires (EvseMonitor
// pauses its own periodic polling for the duration, see
// _relay_recovery_in_flight) rather than blocking this request thread, so
// the rest of the server stays responsive while the cycle runs.
// url: /relay/recovery
// -------------------------------------------------------------------
void handleRelayRecovery(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  evse.runStuckRelayRecovery([request, response](int ret) {
    response->setCode(RAPI_RESPONSE_OK == ret ? 200 : 500);
    response->print(RAPI_RESPONSE_OK == ret ? "{\"msg\":\"done\"}" : "{\"msg\":\"error\"}");
    request->send(response);
  });
}

#ifdef ENABLE_CABLE_TEMP
// -------------------------------------------------------------------
// Cable NTC thermistor monitoring ($GN/$SN via EvseManager, controller
// firmware 9.4.0+). Four logical sources - EV1/EV2 on the EV cable, IN1/IN2
// on the input cable - each with its own reading, thermistor parameters,
// calibration offset and shutdown threshold.
//
// Lives on its own endpoint rather than in /config because the per-source
// configuration is 20 fields and /config's document capacity is documented
// as nearly exhausted. /config keeps only the `cable_temp` on/off flag; the
// live readings are also in /status for telemetry consumers.
//
// GET  /cabletemp -> {"supported":bool,"enabled":bool,"sources":[...]}
// POST /cabletemp <- {"source":0-3,"pin":0-2[,"r25":..,"beta":..,
//                     "offset_c10":..,"panic_c10":..]}
//   Omitting the calibration fields reassigns the pin only, leaving the
//   thermistor parameters alone. Ranges are enforced by the controller,
//   which NAKs anything outside them.
//   n.b. assigning a source to pin 1 (PP_READ) makes the controller turn PP
//   auto-ampacity off - the two cannot share that pin.
// url: /cabletemp
// -------------------------------------------------------------------
void handleCableTemp(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }

  static const char * const source_names[OPENEVSE_CABLE_TEMP_SOURCE_COUNT] = {
    "ev1", "ev2", "in1", "in2"
  };

  if(HTTP_GET == request->method())
  {
    // 4 source objects of 9 members each (source, name, pin, status,
    // temperature, r25, beta, offset_c10, panic_c10), plus the two
    // top-level flags. JSON_OBJECT_SIZE(8) below undercounts that by one
    // member per source; the +512 slack comfortably covers it.
    const size_t capacity = JSON_OBJECT_SIZE(3) +
                            JSON_ARRAY_SIZE(OPENEVSE_CABLE_TEMP_SOURCE_COUNT) +
                            OPENEVSE_CABLE_TEMP_SOURCE_COUNT * JSON_OBJECT_SIZE(8) + 512;
    DynamicJsonDocument doc(capacity);

    doc["supported"] = evse.isCableTempKnown();
    doc["enabled"] = evse.isCableTempEnabled();

    JsonArray sources = doc.createNestedArray("sources");
    for(uint8_t i = 0; i < OPENEVSE_CABLE_TEMP_SOURCE_COUNT; i++)
    {
      JsonObject src = sources.createNestedObject();
      src["source"] = i;
      src["name"] = source_names[i];
      src["pin"] = evse.getCableTempPin(i);
      // 0=ok 1=not installed/unassigned 2=open circuit 3=shorted
      src["status"] = evse.getCableTempStatus(i);
      // Omitted rather than sent as 0 when there is no reading, so a client
      // can't mistake "no sensor" for "0 C" - status says which it is
      if(evse.isCableTempValid(i)) {
        src["temperature"] = evse.getCableTemp(i);
      }
      if(evse.isCableTempConfigKnown()) {
        src["r25"] = evse.getCableTempR25(i);
        src["beta"] = evse.getCableTempBeta(i);
        src["offset_c10"] = evse.getCableTempOffsetC10(i);
        src["panic_c10"] = evse.getCableTempPanicC10(i);
      }
    }

    response->setCode(200);
    serializeJson(doc, *response);
    request->send(response);
    return;
  }

  if(HTTP_POST != request->method()) {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
    request->send(response);
    return;
  }

  MongooseString body = request->body();
  const size_t capacity = JSON_OBJECT_SIZE(8) + 256;
  DynamicJsonDocument doc(capacity);
  if(deserializeJson(doc, body.c_str(), body.length())) {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
    request->send(response);
    return;
  }

  if(!doc.containsKey("source") || !doc.containsKey("pin")) {
    response->setCode(400);
    response->print("{\"msg\":\"source and pin are required\"}");
    request->send(response);
    return;
  }

