OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  // Bounds-check here as well as in the library: these index the cached
  // per-source arrays on the way back out, and a bad index would otherwise
  // only be caught after the RAPI round trip.
  int source = doc["source"] | -1;
  int pin = doc["pin"] | -1;
  if(source < 0 || source >= OPENEVSE_CABLE_TEMP_SOURCE_COUNT ||
     pin < 0 || pin > OPENEVSE_CABLE_TEMP_PIN_PP2) {
    response->setCode(400);
    response->print("{\"msg\":\"source must be 0-3 and pin 0-2\"}");
    request->send(response);
    return;
  }

  auto done = [request, response](int ret) {
    response->setCode(RAPI_RESPONSE_OK == ret ? 200 : 500);
    response->print(RAPI_RESPONSE_OK == ret ? "{\"msg\":\"done\"}" : "{\"msg\":\"error\"}");
    request->send(response);
  };

  // All four calibration fields together, or none of them: the controller's
  // full-configuration form is all-or-nothing, and filling the gaps from the
  // local cache would silently write back a stale value if the cache were
  // cold or another client had changed it.
  bool hasCal = doc.containsKey("r25") && doc.containsKey("beta") &&
                doc.containsKey("offset_c10") && doc.containsKey("panic_c10");
  bool anyCal = doc.containsKey("r25") || doc.containsKey("beta") ||
                doc.containsKey("offset_c10") || doc.containsKey("panic_c10");

  if(anyCal && !hasCal) {
    response->setCode(400);
    response->print("{\"msg\":\"r25, beta, offset_c10 and panic_c10 must be set together\"}");
    request->send(response);
    return;
  }

  if(hasCal) {
    evse.setCableTempConfig((uint8_t)source, (uint8_t)pin,
                            doc["r25"].as<uint32_t>(), doc["beta"].as<uint32_t>(),
                            doc["offset_c10"].as<int32_t>(), doc["panic_c10"].as<int32_t>(),
                            done);
  } else {
    evse.setCableTempPin((uint8_t)source, (uint8_t)pin, done);
  }
}

#endif // ENABLE_CABLE_TEMP

String delayTimer = "0 0 0 0";

void
handleRapi(MongooseHttpServerRequest *request) {
  bool json = isPositive(request, "json");

  int code = 200;

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, json ? CONTENT_TYPE_JSON : CONTENT_TYPE_HTML)) {
    return;
  }

  String s;

  if(false == json) {
    s = F("<html><font size='20'><font color=006666>Open</font><b>EVSE</b></font><p>"
          "<b>Open Source Hardware</b><p>RAPI Command Sent<p>Common Commands:<p>"
          "Set Current - $SC XX<p>Set Service Level - $SL 1 - $SL 2 - $SL A<p>"
          "Get Real-time Current - $GG<p>Get Temperatures - $GP<p>"
          "<p>"
          "<form method='get' action='r'><label><b><i>RAPI Command:</b></i></label>"
          "<input id='rapi' name='rapi' length=32><p><input type='submit'></form>");
  }

  if (request->hasParam("rapi"))
  {
    String rapi = request->getParam("rapi");
    int ret = RAPI_RESPONSE_NK;

    if(!evse.isRapiCommandBlocked(rapi))
    {
      // BUG: Really we should do this in the main loop not here...
      RAPI_PORT.flush();
      DBUGVAR(rapi);
      ret = rapiSender.sendCmdSync(rapi);
      DBUGVAR(ret);
    } else {
      ret = RAPI_RESPONSE_BLOCKED;
    }

    if(RAPI_RESPONSE_OK == ret ||
       RAPI_RESPONSE_NK == ret)
    {
      String rapiString = rapiSender.getResponse();

      // Fake $GD if not supported by firmware
      if(RAPI_RESPONSE_OK == ret && rapi.startsWith(F("$ST"))) {
        delayTimer = rapi.substring(4);
      }
      if(RAPI_RESPONSE_NK == ret)
      {
        if(rapi.equals(F("$GD"))) {
          ret = 0;
          rapiString = F("$OK ");
          rapiString += delayTimer;
        }
        else if (rapi.startsWith(F("$FF")))
        {
          DBUGF("Attempting legacy FF support");

          String fallback = F("$S");
          fallback += rapi.substring(4);

          DBUGF("Attempting %s", fallback.c_str());

          int ret = rapiSender.sendCmdSync(fallback.c_str());
          if(RAPI_RESPONSE_OK == ret)
          {
            String rapiString = rapiSender.getResponse();
          }
        }
      }

      if (json) {
        s = "{\"cmd\":\""+rapi+"\",\"ret\":\""+rapiString+"\"}";
      } else {
        s += html_escape(rapi);
        s += F("<p>&gt;");
        s += html_escape(rapiString);
      }
    }
    else
    {
      String errorString =
        RAPI_RESPONSE_QUEUE_FULL == ret ? F("RAPI_RESPONSE_QUEUE_FULL") :
        RAPI_RESPONSE_BUFFER_OVERFLOW == ret ? F("RAPI_RESPONSE_BUFFER_OVERFLOW") :
        RAPI_RESPONSE_TIMEOUT == ret ? F("RAPI_RESPONSE_TIMEOUT") :
        RAPI_RESPONSE_OK == ret ? F("RAPI_RESPONSE_OK") :
        RAPI_RESPONSE_NK == ret ? F("RAPI_RESPONSE_NK") :
        RAPI_RESPONSE_INVALID_RESPONSE == ret ? F("RAPI_RESPONSE_INVALID_RESPONSE") :
        RAPI_RESPONSE_CMD_TOO_LONG == ret ? F("RAPI_RESPONSE_CMD_TOO_LONG") :
        RAPI_RESPONSE_BAD_CHECKSUM == ret ? F("RAPI_RESPONSE_BAD_CHECKSUM") :
        RAPI_RESPONSE_BAD_SEQUENCE_ID == ret ? F("RAPI_RESPONSE_BAD_SEQUENCE_ID") :
        RAPI_RESPONSE_ASYNC_EVENT == ret ? F("RAPI_RESPONSE_ASYNC_EVENT") :
        RAPI_RESPONSE_BLOCKED == ret ? F("RAPI_RESPONSE_BLOCKED") :
        F("UNKNOWN");

      if (json) {
        s = "{\"cmd\":\""+rapi+"\",\"error\":\""+errorString+"\"}";
      } else {
        s += html_escape(rapi);
        s += F("<p><strong>Error:</strong>");
        s += errorString;
      }

      code = RAPI_RESPONSE_BLOCKED == ret ? 400 : 500;
    }
  }
  if (false == json) {
    s += F("<script type='text/javascript'>document.getElementById('rapi').focus();</script>");
    s += F("<p></html>\r\n\r\n");
  }

  response->setCode(code);
  response->print(s);
  request->send(response);
}

void handleNotFound(MongooseHttpServerRequest *request)
{
  // Not a dynamic handler, check the static resources
  if(web_static_handle(request)) {
    return;
  }

  DBUG("NOT_FOUND: ");
  dumpRequest(request);

  if(net.isWifiModeAp()) {
    // Redirect to the home page in AP mode (for the captive portal)
    MongooseHttpServerResponseStream *response = request->beginResponseStream();
    response->setContentType(CONTENT_TYPE_HTML);

    String url = F("http://");
    url += net.getIp();

    String s = F("<html>");
    s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
    s += url;
    s += F("\" /></head><body><a href=\"");
    s += url;
    s += F("\">OpenEVSE</a></body></html>");

    response->setCode(301);
    response->addHeader(F("Location"), url);
    response->print(s);
    request->send(response);
  } else {
    request->send(404);
  }
}

void handleHttpsRedirect(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_HTML);

  // The Host header carries the port the client reached us on, which is the
  // HTTP listener's -- redirecting to it verbatim would just bounce the browser
  // back here. Keep the hostname the user typed (it has to match the
  // certificate) and substitute the HTTPS port.
  String host = request->host().toString();
  int portSep = host.lastIndexOf(':');
  // An unbracketed ':' in an IPv6 literal is part of the address, not a port.
  if(portSep >= 0 && host.indexOf(']') < portSep) {
    host.remove(portSep);
  }

  String url = F("https://");
  url += host;
  if(443 != www_https_port) {
    url += ":";
    url += String(www_https_port);
  }
  url += request->uri().toString();

  String s = F("<html>");
  s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
  s += url;
  s += F("\" /></head><body><a href=\"");
  s += url;
  s += F("\">OpenEVSE</a></body></html>");

  response->setCode(301);
  response->addHeader(F("Location"), url);
  response->print(s);
  request->send(response);
}

