OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  server.on("/logs/export", handleLogsExport);
  server.on("/logs", handleEventLogs);
  server.on("/certificates/#", handleCertificates);
  server.on("/certificates", handleCertificates);
  server.on("/limit", handleLimit);
  server.on("/boost", handleBoost);
  server.on("/notifications/ack", handleNotificationAck);
  server.on("/notifications", handleNotifications);
  server.on("/emeter", handleEmeter);
  server.on("/time", handleTime);
  server.on("/mqtt", handleMqttAction);

#ifndef ENABLE_TSDB
  server.on("/energy/raw", handleEnergyRaw);
  server.on("/energy/daily", handleEnergyDaily);
  server.on("/energy/monthly", handleEnergyMonthly);
  server.on("/energy/annual", handleEnergyAnnual);
#else // ENABLE_TSDB
  server.on("/energy/raw", handleEnergyRaw);
  server.on("/energy/daily", handleEnergyDaily);
  server.on("/energy/weekly", handleEnergyWeekly);
  server.on("/energy/monthly", handleEnergyMonthly);
  server.on("/energy/annual", handleEnergyAnnual);
#endif // ENABLE_TSDB

  // Simple Firmware Update Form
  server.on("/update")->
    onRequest(handleUpdateRequest)->
    onUpload(handleUpdateUpload)->
    onClose(handleUpdateClose);

  // In-place 16MB flash repartition (16MB module flashed with 4MB layout)
  server.on("/migrate/expand16mb", handleMigrateExpand16mb);
  server.on("/migrate/status", handleMigrateStatus);
  server.on("/migrate/coredump", handleMigrateCoredump);

  server.on("/debug", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialDebug.printBuffer(*response);
    request->send(response);
  });

  // -----------------------------------------------------------------
  // Last-panic forensics. A crash on a deployed unit leaves a core dump in
  // flash that outlives the reboot; these two endpoints are what make it
  // reachable without a serial cable.
  //
  //   GET    /debug/crash      decoded summary (task, PC, backtrace)
  //   DELETE /debug/crash      clear it, so the next panic is unambiguous
  //   GET    /debug/crash/raw  the image itself, for esp-coredump
  // -----------------------------------------------------------------
  server.on("/debug/crash", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
      return;
    }

    if(HTTP_DELETE == request->method()) {
      bool erased = diagnostics_coredump_erase();
      response->setCode(erased ? 200 : 500);
      response->print(erased ? F("{\"msg\":\"erased\"}") : F("{\"msg\":\"error\"}"));
      request->send(response);
      return;
    }

    const size_t capacity = JSON_OBJECT_SIZE(12) + JSON_ARRAY_SIZE(16) + 640;
    DynamicJsonDocument doc(capacity);
    diagnostics_coredump_json(doc);
    response->setCode(200);
    serializeJson(doc, *response);
    request->send(response);
  });

  server.on("/debug/crash/raw", [](MongooseHttpServerRequest *request) {
    dumpRequest(request);

    // Not routed through requestPreProcess: that opens a buffered stream
    // response, and the whole point here is to send from a flash mapping
    // instead of buffering the image in a heap that has no room for it.
    if(!isAuthenticated(request)) {
      request->requestAuthentication(esp_hostname);
      return;
    }

    const uint8_t *data = NULL;
    size_t len = 0;
    if(!diagnostics_coredump_image(&data, &len)) {
      MongooseHttpServerResponseStream *response = request->beginResponseStream();
      response->setContentType(CONTENT_TYPE_JSON);
      response->setCode(404);
      response->print(F("{\"msg\":\"none\"}"));
      request->send(response);
      return;
    }

    MongooseHttpServerResponseBasic *response = request->beginResponse();
    response->setCode(200);
    response->setContentType("application/octet-stream");
    response->setContentLength(len);
    response->addHeader(F("Content-Disposition"), F("attachment; filename=\"coredump.bin\""));
    response->addHeader(F("Cache-Control"), F("no-store"));
    response->setContent(data, len);
    request->send(response);
  });

  server.on("/debug/console", [](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
    // Intentionally no-op: this endpoint is server-push only via SerialDebug.onWrite.
  })->onConnect([](MongooseHttpWebSocketConnection *connection) {
    wsAuthorise(connection);
  });

  SerialDebug.onWrite([](const uint8_t *buffer, size_t size)
  {
    web_server_send_all("/debug/console", buffer, size);
  });

  server.on("/evse", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialEvse.printBuffer(*response);
    request->send(response);
  });

  server.on("/evse/console", [](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
    // Intentionally no-op: this endpoint is server-push only via SerialEvse callbacks.
  })->onConnect([](MongooseHttpWebSocketConnection *connection) {
    wsAuthorise(connection);
  });

  SerialEvse.onWrite([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });
  SerialEvse.onRead([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });

  // onWsConnect() applies the auth gate; see wsAuthorise().
  server.on("/ws", onWsFrame)->onConnect(onWsConnect);

  // Setup load sharing endpoints
  web_server_load_sharing_setup(server);
}

void web_server_setup()
{
  http_server_started = false;
  https_server_started = false;

  bool use_ssl = false;
  if(config_https_enabled() && www_certificate_id != "")
  {
    // This one sits on the boot path: a corrupted stored www_certificate_id
    // parsed with a throwing conversion would abort inside web_server_setup()
    // and boot-loop the unit with no way back in over the network. Fall through
    // to plain HTTP instead, which at least leaves the device reachable to
    // correct the config.
    uint64_t cert_id = 0;
    bool id_valid = certificate_id_from_string(www_certificate_id.c_str(), cert_id);
    if(!id_valid) {
      DEBUG.printf("Ignoring malformed www_certificate_id '%s', serving HTTPS disabled\n", www_certificate_id.c_str());
    }

    const char *cert = id_valid ? certs.getCertificate(cert_id) : NULL;
    const char *key = id_valid ? certs.getKey(cert_id) : NULL;
    if(NULL != cert && NULL != key)
    {
      DEBUG.printf("Starting HTTPS server, https://0.0.0.0:%d\n", www_https_port);
      https_server.begin(www_https_port, cert, key);
      registerWebServerRoutes(https_server, true);
      https_server.onNotFound(handleNotFound);
      https_server_started = true;
      use_ssl = true;
    }
  }

